Repository: Husan-Muhiddinov/Milliy-Hub
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: address
uz: Manzil

source: start_work
uz: Ish boshlaninsh kuni

source: finish_work
uz: Ish tugash kuni

source: work_created_at
uz: Ish boshlash vaqti

source: work_updated_at
uz: Ish tugash vaqti

source: phone_number
uz: telefon nomer

source: title
uz: sarlavha

source: body
uz: tanasi

source: icon
uz: ikon

source: image
uz: rasm

source: work
uz: ish

source: position
uz: lavozimi

source: status
uz: holat

source: detail_title
uz: batafsil sarlavha

source: summary
uz: xulosa

source: client_name
uz: mijoz nomi

source: project_value
uz: loyiha qiymati

source: year_completed
uz: yil yakunlandi

source: project_under
uz: ostidagi loyiha

source: advisor
uz: maslahatchi

source: name
uz: ismi

source: subject
uz: Mavzu

source: author
uz: avtor

source: photo
uz: rasm

source: day
uz: kun

source: comment
uz: izoh

source: job
uz: kasb

source: consultants
uz: maslahatchilar

source: awards
uz: mukofotlari

source: our_mission
uz: bizning_missiyamiz

source: our_vision
uz: bizning_vizionimiz

source: answer
uz: savollar

source: benifits
uz: foyda

source: mutual_funds
uz: o'zaro_fondlar

source: company_growth
uz: kompaniya_o'sishi

source: Home
uz: Bosh sahifa

source: Our Key Feature of Service
uz: Xizmatning asosiy xususiyati

source: Benefits
uz: Foyda

source: Mutual Funds
uz: O'zaro fondlar

source: Company Growht
uz: Kompaniyaning o'sishi

source: Services
uz: Xizmatlar

source: Financial Planning
uz: Moliyaviy rejalashtirish

source: Trade & Stock
uz: Savdo & birja

source: Audit & Assurance
uz: Audit & Ishonchnoma

source: Saving Strategy
uz: Saqlash strategiyasi

source: Strategic Planning
uz: Strategik rejalashtirish

source: Download
uz: Yuklab olish

source: Provide Solutions For the Realiable Growth
uz: Haqiqiy o'sish uchun yechimlarni taqdim eting

source: Get A Quotes
uz: Iqtibos olish

source: About
uz: Biz haqimizda

source: Us
uz: Biz

source: We Are Expert
uz: Biz Mutaxassismiz

source: Consultatns
uz: Maslahatchilar

source: Awards
uz: Mukofotlar

source: Cases Completed
uz: Ishlar tugallandi

source: Our Mission
uz: Bizning missiyamiz

source: Our
uz: Bizning

source: Vision
uz: Vizyon

source: You are
uz: Siz

source: 10 minitues away from the Help you need
uz: Sizga kerak bo'lgan yordamdan 10 daqiqa uzoqlikda

source: Capitalize on low hanging fruit to identify a ballpark value added activity to beta test.
uz: Beta-testga qo'shilgan qiymatli faollikni aniqlash uchun past osilgan mevalarni kapitallashtiring.

source: We are always ready
uz: Biz har doim tayyormiz

source: Request a call back
uz: Qayta qo'ng'iroq qilishimiz uchun

source: Integrity
uz: Butunlik

source: Thinking of Building
uz: Bino haqida o'ylash

source: We help global leaders with their organization’s most critical issues and opportunities. Together, we create enduring change and results
uz: Biz global yetakchilarga tashkilotning eng muhim masalalari va imkoniyatlari bilan yordam beramiz. Birgalikda biz doimiy o'zgarishlar va natijalarni yaratamiz

source: Explore All Cases
uz: Barcha holatlarni o'rganing

source: Some FAQ’s
uz: Ba'zi tez-tez so'raladigan savollar

source: Frequently Asked Questions
uz: tez-tez so'raladigan savollar

source: Some State skill
uz: Ba'zi davlat mahorati

source: Our Statistics Rate
uz: Bizning statistika kursimiz

source: This product is meant for educational purposes only. Resemblance to real persons, living or dead is coincidental.
uz: Ushbu mahsulot faqat ta'lim maqsadlari uchun mo'ljallangan. Haqiqiy odamlarga, tirik yoki o'liklarga o'xshashlik tasodifdir.

source: Analysis
uz: Tahlil

source: Eeconomic Growth
uz: Iqtisodiy o'sish

source: Achieves Goals
uz: Maqsadlarga erishadi

source: Why Us
uz: Nima uchun Biz

source: Read Why We Expert
uz: Nima uchun biz ekspertizni o'qing

source: in The Market
uz: Bozorda

source: This product is meant for educational purposes only. Resemblance to real persons, living or dead is purely coincidental. Void prohibited. Some assembly required. List each check separately by number.
uz: Ushbu mahsulot faqat ta'lim maqsadlari uchun mo'ljallangan. Haqiqiy odamlarga, tirik yoki o'liklarga o'xshashlik mutlaqo tasodifdir. Bekor qilish taqiqlangan. Ba'zi yig'ish kerak. Har bir chekni raqam bo'yicha alohida ko'rsating.

source: Dedicated Team
uz: Maxsus jamoa

source: Best Advisors
uz: Eng yaxshi maslahatchilar

source: Network Solutions
uz: Tarmoq yechimlari

source: Supports
uz: Qo'llab-quvvatlaydi

source: Work Deadline
uz: Ishning oxirgi muddati

source: Get Start
uz: Boshlash

source: How We Work
uz: Biz qanday ishlaymiz

source: We Make Successful Business in
uz: Biz muvaffaqiyatli biznes qilamiz

source: Steps
uz: ta Qadam

source: We Aim to Provide Expert Advice and Quality Service.
uz: Biz ekspert maslahati va sifatli xizmat ko'rsatishni maqsad qilganmiz.

source: We are rethoric question ran over her cheek When she reached the first hills of the Italic Mountains, she had a last view back on the skyline of her hometown Bookmarksgrove, the headline of Alphabet Village and the subline of her own road, the Line Lane.
uz: U kursiv tog'larning birinchi tepaliklariga etib kelganida, u o'z shahrining Bookmarksgrove osmonini, Alphabet qishlog'ining sarlavhasini va o'z yo'lining pastki chizig'i - Chiziq chizig'ini oxirgi marta ko'rdi.

source: Finance
uz: Moliya

source: Address
uz: Manzil

source: to
uz: dan

source: Sunday Closed
uz: Yakshanba Yopiq

source: Call Us for Any Questions
uz: Har qanday savol uchun bizga qo'ng'iroq qiling

source: Service Detail
uz: Xizmat tafsilotlari

source: Cases
uz: Ishlar

source: Case Detail
uz: Ish tafsilotlari

source: Pages
uz: Sahifalar

source: Pricing
uz: Narxlash

source: Our Team
uz: Bizning Jamoamiz

source: Blog Detail
uz: Blog tafsilotlari

source: Contact
uz: Bog'lanish

source: We provide expert Business Coaching to both individuals and businesses. With over 30 years of experience we’ll ensure that you’re always getting the best guidance from the top people in the entire industry.
uz: Biz jismoniy shaxslarga ham, korxonalarga ham mutaxassis biznes kouchingini taqdim etamiz. Ancha yillik tajribamiz bilan biz har doim butun sohadagi eng yaxshi odamlardan eng yaxshi yo'l-yo'riq olishingizni ta'minlaymiz.

source: Latest News
uz: So'ngi yangiliklar

source: Newsletter
uz: Yangiliklar xati

source: Sign up for our mailing list to Get Latest updates And offers.
uz: So'nggi yangilanishlar va takliflarni olish uchun pochta ro'yxatimizga obuna bo'ling.

source: Privacy Policy
uz: Maxfiylik siyosati

source: Investors
uz: Investorlar

source: Legals
uz: Qonunchilik

source: Designed By
uz: Tomonidan ishlab chiqilgan:

source: ARY Themes
uz: Sanjarbek Usmonov

source: Choose Your Color
uz: Rangingizni tanlang

source: Purchase now
uz: Hozir sotib oling

source: You will find much more options for colors and styling in admin panel. This color picker is used only for demonstation purposes.
uz: Administrator panelida ranglar va uslublar uchun ko'proq variantlarni topasiz. Ushbu rang tanlash vositasi faqat namoyish qilish uchun ishlatiladi.

source: News
uz: Yangiliklar

source: Share:
uz: Ulashish:

source: Recent Posts
uz: So'nggi xabarlar

source: Best Categories
uz: Eng yaxshi toifalar

source: Corporate
uz: Korporativ

source: Portfolio
uz: Portfel

source: Finince
uz: Moliya

source: Cool Tags
uz: Ajoyib teglar

source: Fashion
uz: Moda

source: Money
uz: Pul

source: Entertanment
uz: O'yin-kulgi

source: Logo
uz: Logotip

source: Development
uz: Rivojlanish

source: All
uz: Hammasi

source: Incubation
uz: Inkubatsiya

source: programs
uz: dasturlari

source: Acceleration
uz: Tezlashtirish

source: us
uz: Biz

source: Write a Message
uz: Xabar yozing

source: Hight Quality Market
uz: Yuqori sifatli bozor

source: Experaiences
uz: Tajribalar

source: Nobody’s more committed to connecting you with the exceptional top talents with the right fit for your business than us
uz: Hech kim sizni biznesingizga mos keladigan ajoyib iste'dodlar bilan bog'lashga bizdan ko'ra ko'proq intilmaydi.

source: Know MORE
uz: KO'PROQ BILISH

source: We Provide Solution to
uz: Biz Yechimni Ta'minlaymiz

source: Grow Your Business
uz: Biznesingizni rivojlantiring

source: More
uz: bilish

source: What We Provide
uz: Biz nima taqdim etamiz

source: Our Best Work
uz: Bizning eng yaxshi ishimiz

source: View All
uz: Hammasini ko'rish

source: Price List
uz: Narxlar ro'yxati

source: Client Prospecting
uz: Mijozlarni qidirish

source: Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.
uz: Proaktiv hukmronlikni ta'minlash uchun g'alaba qozonish omon qolish strategiyalarini stolga keltiring. Oxir oqibat, oldinga X avloddan boshlab yangi norma uchish-qo'nish yo'lagida qulay bulutli yechim tomon yo'l oladi. Haqiqiy vaqtda foydalanuvchi tomonidan yaratilgan kontent offshoring uchun bir nechta aloqa nuqtalariga ega bo'ladi.

source: Document Verification
uz: Hujjatni tekshirish

source: Leverage agile frameworks to provide a robust synopsis for high level overviews. It erative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment. User generated content in real-time will have multiple touchpoints for offshoring.
uz: Yuqori darajadagi sharhlar uchun ishonchli konspektni taqdim etish uchun tezkor ramkalardan foydalaning. Korporativ strategiyaga yangi yondashuvlar umumiy qiymat taklifini ilgari surish uchun hamkorlikda fikrlashni rivojlantiradi. Ish joyidagi xilma-xillik va imkoniyatlarni kengaytirish orqali buzg'unchi innovatsiyalarning yaxlit dunyoqarashini organik ravishda rivojlantiring. Haqiqiy vaqtda foydalanuvchi tomonidan yaratilgan kontent offshoring uchun bir nechta aloqa nuqtalariga ega bo'ladi.

source: Operations Directors
uz: Operatsion direktorlar
